Problems on Excel

Problems can be found here: https://www.w3resource.com/python-exercises/pandas/excel/index.php

In [10]:
#importing modules
import pandas as pd
import numpy as np

**Problem 1.)** Write a Pandas program to import excel data (coalpublic2013.xlsx ) into a Pandas dataframe

In [3]:
import pandas as pd
coalpublic = pd.read_excel('coalpublic2013.xlsx', header = 0)
coalpublic.head()

   Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0  2013   103381            Tacoa Highwall Miner       56004        22392
1  2013   103404                Reid School Mine       28807        28447
2  2013   100759  North River #1 Underground Min     1440115       474784
3  2013   103246                      Bear Creek       87587        29193
4  2013   103451                     Knight Mine      147499        46393

**Problem 2.)** Write a Pandas program to get the data types of the given excel data (coalpublic2013.xlsx ) fields

In [4]:
coalpublic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Year         50 non-null     int64
 1   MSHA ID      50 non-null     int64
 2   Mine_Name    50 non-null     object
 3   Production   50 non-null     int64
 4   Labor_Hours  50 non-null     int64
dtypes: int64(4), object(1)
memory usage: 2.1+ KB

In [5]:
#or 
coalpublic.dtypes

Year            int64
MSHA ID         int64
Mine_Name      object
Production      int64
Labor_Hours     int64
dtype: object

**Problem 3.)** Write a Pandas program to read specific columns from a given excel file

In [7]:
coalpublic = pd.read_excel('coalpublic2013.xlsx', usecols = ['Year', 'Mine_Name'])
coalpublic.head()

   Year                       Mine_Name
0  2013            Tacoa Highwall Miner
1  2013                Reid School Mine
2  2013  North River #1 Underground Min
3  2013                      Bear Creek
4  2013                     Knight Mine

**Problem 4.)** Write a Pandas program to find the sum, mean, max, min value of 'Production (short tons)' column of coalpublic2013.xlsx file

In [8]:
coalpublic = pd.read_excel('coalpublic2013.xlsx')
coalpublic.head()

   Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0  2013   103381            Tacoa Highwall Miner       56004        22392
1  2013   103404                Reid School Mine       28807        28447
2  2013   100759  North River #1 Underground Min     1440115       474784
3  2013   103246                      Bear Creek       87587        29193
4  2013   103451                     Knight Mine      147499        46393

In [11]:
coalpublic.agg({'Production':[sum,np.mean, max, min]})

       Production
sum   27854323.00
mean    557086.46
max    7602722.00
min          0.00

<div class="alert alert-block alert-info">
<b>Problem 5.) Write a Pandas program to insert a column in the sixth position of the said excel sheet and fill it with NaN values

In [12]:
coalpublic.head()

   Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0  2013   103381            Tacoa Highwall Miner       56004        22392
1  2013   103404                Reid School Mine       28807        28447
2  2013   100759  North River #1 Underground Min     1440115       474784
3  2013   103246                      Bear Creek       87587        29193
4  2013   103451                     Knight Mine      147499        46393

In [13]:
coalpublic['col6'] = np.nan

In [14]:
coalpublic.head()

,Year,MSHA ID,Mine_Name,Production,Labor_Hours,col6
0,2013,103381,Tacoa Highwall Miner,56004,22392,NaN
1,2013,103404,Reid School Mine,28807,28447,NaN
2,2013,100759,North River #1 Underground Min,1440115,474784,NaN
3,2013,103246,Bear Creek,87587,29193,NaN
4,2013,103451,Knight Mine,147499,46393,NaN

**Sample Solution 5.)**

In [16]:
import pandas as pd
import numpy as np
df = pd.read_excel('coalpublic2013.xlsx')
df.insert(3, "column1", np.nan)

In [17]:
df.head()

,Year,MSHA ID,Mine_Name,column1,Production,Labor_Hours
0,2013,103381,Tacoa Highwall Miner,NaN,56004,22392
1,2013,103404,Reid School Mine,NaN,28807,28447
2,2013,100759,North River #1 Underground Min,NaN,1440115,474784
3,2013,103246,Bear Creek,NaN,87587,29193
4,2013,103451,Knight Mine,NaN,147499,46393

Thoughts: so you can use **df.insert()** allows you to insert a column into a dataframe at a desired position

**Problem 6.)** Write a Pandas program to import some excel data (coalpublic2013.xlsx ) skipping first twenty rows into a Pandas dataframe

In [20]:
coalpublic = pd.read_excel('coalpublic2013.xlsx', header = 0, skiprows = lambda x: x in np.arange(1,21,1))
coalpublic.head()

   Year  MSHA ID            Mine_Name  Production  Labor_Hours
0  2013   103380               Calera           0        12621
1  2013   103380               Calera           0         1402
2  2013   103422      Clark No 1 Mine      122727       140250
3  2013   103467  Helena Surface Mine       59664        30539
4  2013   101247            No 4 Mine     2622528      1551141

**Problem 7.)** Write a Pandas program to add summation to a row of the given excel file

In [21]:
#not really sure what this question is wanting,

In [23]:
coalpublic = pd.read_excel('coalpublic2013.xlsx')
coalpublic.agg({'Year' : sum, 'MSHA ID' : sum, 'Mine_Name' : sum, 'Production': sum, 'Labor_Hours':sum})

Year                                                      100650
MSHA ID                                                 11558442
Mine_Name      Tacoa Highwall MinerReid School MineNorth Rive...
Production                                              27854323
Labor_Hours                                             11098816
dtype: object

In [24]:
coalpublic.sum()

Year                                                      100650
MSHA ID                                                 11558442
Mine_Name      Tacoa Highwall MinerReid School MineNorth Rive...
Production                                              27854323
Labor_Hours                                             11098816
dtype: object

**Sample Solution 7.)**

In [26]:
import pandas as pd
import numpy as np
df = pd.read_excel('coalpublic2013.xlsx')
sum_row=df[["Production", "Labor_Hours"]].sum()
df_sum=pd.DataFrame(data=sum_row).T
df_sum=df_sum.reindex(columns=df.columns)
df_sum

   Year  MSHA ID  Mine_Name  Production  Labor_Hours
0   NaN      NaN        NaN    27854323     11098816

<div class="alert alert-block alert-info">
<b>Problem 8.) Write a Pandas program to import excel data (coalpublic2013.xlsx ) into a Pandas dataframe and display the last ten rows

In [29]:
coalpublic = pd.read_excel('coalpublic2013.xlsx')
coalpublic.iloc[(len(coalpublic) - 10) : len(coalpublic)]

    Year  MSHA ID         Mine_Name  Production  Labor_Hours
40  2013   103372   Cane Creek Mine       66258        32401
41  2013   103376        Town Creek      299167       176499
42  2013   103389  Carbon Hill Mine       76241        84966
43  2013   103410  Coal Valley Mine      407841       158591
44  2013   103423  Dutton Hill Mine       37275         9162
45  2013  1519322           Ghm #25       25054         3108
46  2013   103321    Poplar Springs      189370        76366
47  2013   103358         Old Union      284563       161805
48  2013  5000030          Usibelli     1631584       286079
49  2013   201195      Kayenta Mine     7602722      1015333

**Sample Solution 8.)**

In [31]:
import pandas as pd
import numpy as np
df = pd.read_excel('coalpublic2013.xlsx')
df.tail(n=10)

    Year  MSHA ID         Mine_Name  Production  Labor_Hours
40  2013   103372   Cane Creek Mine       66258        32401
41  2013   103376        Town Creek      299167       176499
42  2013   103389  Carbon Hill Mine       76241        84966
43  2013   103410  Coal Valley Mine      407841       158591
44  2013   103423  Dutton Hill Mine       37275         9162
45  2013  1519322           Ghm #25       25054         3108
46  2013   103321    Poplar Springs      189370        76366
47  2013   103358         Old Union      284563       161805
48  2013  5000030          Usibelli     1631584       286079
49  2013   201195      Kayenta Mine     7602722      1015333

Thoughts: could have also used the function **df.tail()** to get the last records